pmo-dataset/graphviz/18.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "ExclusiveGateway_6" -> "end";
  "Add/drop courses" -> "ExclusiveGateway_15";
  "ParallelGateway_5" -> "ExclusiveGateway_3";
  "Send acceptance\nletter" -> "ExclusiveGateway_16";
  "Assist with visa\nprocessing" -> "ExclusiveGateway_13";
  "Await decision" -> "ExclusiveGateway_5";
  "ParallelGateway_1" -> "Send orientation\nmaterials";
  "ExclusiveGateway_13" -> "ParallelGateway_6";
  "ExclusiveGateway_7" -> "ExclusiveGateway_15";
  "Begin attending\nclasses" -> "ExclusiveGateway_7";
  "start" -> "Submit application\nonline";
  "Send rejection\nletter" -> "ExclusiveGateway_6";
  "ParallelGateway_3" -> "ExclusiveGateway_9";
  "ExclusiveGateway_8" -> "Submit appeal form";
  "ExclusiveGateway_16" -> "Cancel application";
  "Select courses" -> "Resolve schedule\nconflicts";
  "ExclusiveGateway_3" -> "Send rejection\nletter";
  "Meet with appeals\ncommittee" -> "Await decision";
  "ParallelGateway_1" -> "Set up IT accounts";
  "ExclusiveGateway_10" -> "Notify applicant of\nmissing documents";
  "ParallelGateway_2" -> "Evaluate application\nby admissions\ncommittee";
  "ExclusiveGateway_14" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Process fees or\nwaivers";
  "Meet with academic\nadvisor" -> "Select courses";
  "Submit appeal form" -> "Meet with appeals\ncommittee";
  "Review application\nand documents" -> "ExclusiveGateway_10";
  "ExclusiveGateway_7" -> "Add/drop courses";
  "Notify applicant of\nmissing documents" -> "Provide missing\ndocuments";
  "Obtain student ID\ncard" -> "ParallelGateway_3";
  "Cancel application" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "ExclusiveGateway_6";
  "ExclusiveGateway_4" -> "Assist with visa\nprocessing";
  "Submit application\nonline" -> "Review application\nand documents";
  "ExclusiveGateway_1" -> "Withdraw";
  "Post grades" -> "Review grades online";
  "ExclusiveGateway_1" -> "Graduate";
  "Send orientation\nmaterials" -> "ParallelGateway_4";
  "ParallelGateway_6" -> "Meet with academic\nadvisor";
  "ExclusiveGateway_5" -> "ExclusiveGateway_11";
  "Evaluate application\nby admissions\ncommittee" -> "ParallelGateway_5";
  "Review grades online" -> "ExclusiveGateway_8";
  "ExclusiveGateway_11" -> "ExclusiveGateway_1";
  "ParallelGateway_4" -> "ExclusiveGateway_4";
  "Confirm enrollment" -> "ParallelGateway_1";
  "Set up IT accounts" -> "ParallelGateway_4";
  "ExclusiveGateway_4" -> "ExclusiveGateway_13";
  "ExclusiveGateway_10" -> "ExclusiveGateway_14";
  "Process fees or\nwaivers" -> "ParallelGateway_5";
  "ExclusiveGateway_3" -> "Send acceptance\nletter";
  "ParallelGateway_6" -> "Obtain student ID\ncard";
  "Graduate" -> "ExclusiveGateway_12";
  "ExclusiveGateway_15" -> "Post grades";
  "Withdraw" -> "ExclusiveGateway_12";
  "ExclusiveGateway_9" -> "Begin attending\nclasses";
  "ExclusiveGateway_12" -> "ExclusiveGateway_2";
  "ExclusiveGateway_11" -> "ExclusiveGateway_9";
  "Provide missing\ndocuments" -> "ExclusiveGateway_14";
  "Resolve schedule\nconflicts" -> "ParallelGateway_3";
  "ExclusiveGateway_8" -> "ExclusiveGateway_5";
  "ExclusiveGateway_16" -> "Confirm enrollment";

  "start" [shape=circle];
  "end" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "ExclusiveGateway_7" [label="X", shape=diamond];
  "ExclusiveGateway_8" [label="X", shape=diamond];
  "ExclusiveGateway_9" [label="X", shape=diamond];
  "ExclusiveGateway_10" [label="X", shape=diamond];
  "ExclusiveGateway_11" [label="X", shape=diamond];
  "ExclusiveGateway_12" [label="X", shape=diamond];
  "ExclusiveGateway_13" [label="X", shape=diamond];
  "ExclusiveGateway_14" [label="X", shape=diamond];
  "ExclusiveGateway_15" [label="X", shape=diamond];
  "ExclusiveGateway_16" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
  "ParallelGateway_5" [label="+", shape=diamond];
  "ParallelGateway_6" [label="+", shape=diamond];
}
